/*
 * Copyright 2011 Jason Rush and John Flanagan. All rights reserved.
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */

"Files" = "Files";
"Databases" = "Database";
"Key File" = "Key File";
"Key Files" = "Key Files";
"Groups" = "Gruppi";
"Entries" = "Voci";
"Group" = "Gruppo";
"Entry" = "Voce";
"New Database" = "Nuovo Database";
"New Group" = "Nuovo Gruppo";
"New Entry" = "Nuova Voce";
"Edit Group" = "Modifica Gruppo";
"Title" = "Titolo";
"Image" = "Immagine";
"Images" = "Images"; // FIXME Needs translation
"Username" = "Utente";
"Password" = "Password";
"Confirm Password" = "Conferma Password";
"URL" = "URL";
"Comments" = "Commenti";
"OK" = "OK";
"Cancel" = "Cancella";
"Edit" = "Modifica";
"Copy" = "Copia";
"Add" = "Aggiungi";
"Search" = "Cerca";
"Help" = "Aiuto";
"Version 1.x" = "Versione 1.x";
"Version 2.x" = "Versione 2.x";
"None" = "Nessuno";
"Name" = "Nome";
"Value" = "Value"; // FIXME Needs translation
"Rename" = "Rinomina";
"Database Name" = "Nome Database";
"Last Modified" = "Last Modified"; // FIXME Needs translation
"Copied" = "Copied"; // FIXME Needs translation
"In Memory Protection" = "In Memory Protection"; // FIXME Needs translation

// General Messages
"Enter your PIN to unlock" = "Inserisci il tuo PIN per sbloccare";
"Enter the password and/or select the keyfile for the %@ database." = "Inserisci la password e/o seleziona il keyfile per il database %@.";
"No password or keyfile specified" = "Inserisci password e/o keyfile";
"Enter a new name for the password database. The correct file extension will automatically be appended." = "Inserisci un nuovo nome per il database delle password. L'estensione corretta del file sarà aggiunta automaticamente.";

// Error Messages
"Group name is invalid" = "Il nome del gruppo non è valido";
"Database name is required" = "È richiesto un nome per il database";
"Passwords do not match" = "Le password non corrispondono";
"Password is required" = "È richiesta la password";
"Incorrect PIN" = "PIN errato";
"Incorrect PIN\n1 attempt remaining" = "PIN errato\n Rimane 1 tentativo";
"Incorrect PIN\n2 attempts remaining" = "PIN errato\n Rimangono 2 tentativi";
"Incorrect PIN\n3 attempts remaining" = "PIN errato\n Rimangono 3 tentativi";
"Incorrect PIN\n4 attempts remaining" = "PIN errato\n Rimangono 4 tentativi";
"Incorrect PIN\n5 attempts remaining" = "PIN errato\n Rimangono 5 tentativi";
"Incorrect PIN\n6 attempts remaining" = "PIN errato\n Rimangono 6 tentativi";
"Incorrect PIN\n7 attempts remaining" = "PIN errato\n Rimangono 7 tentativi";
"Incorrect PIN\n8 attempts remaining" = "PIN errato\n Rimangono 8 tentativi";
"Incorrect PIN\n9 attempts remaining" = "PIN errato\n Rimangono 9 tentativi";
"Incorrect PIN\n10 attempts remaining" = "PIN errato\n Rimangono 10 tentativi";
"Incorrect PIN\n11 attempts remaining" = "PIN errato\n Rimangono 11 tentativi";
"Incorrect PIN\n12 attempts remaining" = "PIN errato\n Rimangono 12 tentativi";
"Incorrect PIN\n13 attempts remaining" = "PIN errato\n Rimangono 13 tentativi";
"Incorrect PIN\n14 attempts remaining" = "PIN errato\n Rimangono 14 tentativi";
"Filename is invalid" = "Nome del file non valido";
"A file already exists with this name" = "Esiste già un file con questo nome";
"There are no applications installed capable of importing KeePass files" = "Non ci sono applicazioni installate capaci di importare i file KeePass";
"You do not have any KeePass files available for MiniKeePass to open." = "Non ci sono file che possano essere aperti come database KeePass.";

// Settings Page
"Settings" = "Impostazioni";
"PIN Enabled" = "PIN abilitato";
"Lock Timeout" = "Timeout blocco";
"Immediately" = "Immediatamente";
"30 Seconds" = "30 Secondi";
"1 Minute" = "1 Minuto";
"2 Minutes" = "2 Minuti";
"3 Minutes" = "3 Minuti";
"5 Minutes" = "5 Minuti";
"Enabled" = "Abilitato";
"Attempts" = "Tentativi";
"Close Enabled" = "Chiusura Abilitata";
"Close Timeout" = "Timeout Chiusura";
"Hide Passwords" = "Nascondi password";
"Sorting" = "Ordinamento";
"Sort Groups and Entries Alphabetically" = "Ordina Gruppi e Voci alfabeticamente";
"Encoding" = "Codifica";
"UTF-8" = "UTF-8";
"UTF-16 Big Endian" = "UTF-16 Big Endian";
"UTF-16 Little Endian" = "UTF-16 Little Endian";
"Latin 1 (ISO/IEC 8859-1)" = "Latin 1 (ISO/IEC 8859-1)";
"Latin 2 (ISO/IEC 8859-2)" = "Latin 2 (ISO/IEC 8859-2)";
"7-Bit ASCII" = "7-Bit ASCII";
"Japanese EUC" = "Japanese EUC";
"ISO-2022-JP" = "ISO-2022-JP";
"PIN Protection" = "Protezione PIN";
"Delete All Data on PIN Failure" = "Cancella Tutti i Dati per PIN errato";
"Close Database on Timeout" = "Chiudi il database dopo un Timeout";
"Remember Database Passwords" = "Ricorda il database delle password";
"Hide Passwords" = "Nascondi le password";
"Password Encoding" = "Codifica Password";
"Clear Clipboard on Timeout" = "Cancella la Clipboard dopo un Timeout";
"Clear Timeout" = "Timeout";
"Prevent unauthorized access to MiniKeePass with a PIN." = "Abilita il blocco di MiniKeePass dopo il tempo di inattività impostato. Lo sblocco avviene inserendo un PIN.";
"Delete all files and passwords after too many failed attempts." = "Cancella tutti i file e password se il PIN è errato per un numero di tentativi consecutivi superiore a quanto impostato.";
"Automatically close an open database after the selected timeout." = "Chiudi automaticamente un database aperto dopo il timeout selezionato.";
"Stores remembered database passwords in the devices's secure keychain." = "Memorizza le password del database nel portachiavi sicuro del dispositivo.";
"Hides passwords when viewing a password entry." = "Nascondi le password quando visualizzi una voce.";
"The string encoding used for passwords when converting them to database keys." = "Codifica di caratteri usato per le password salvate nel database.";
"Clear the contents of the clipboard after a given timeout upon performing a copy." = "I dati copiati nella clipboard saranno automaticamente cancellati allo scadere del tempo impostato.";
"Close Timeout" = "Timeout chiusura";
"Clear Clipboard Timeout" = "Timeout cancellazione Clipboard";
"Set PIN" = "Imposta PIN";
"Confirm PIN" = "Conferma PIN";
"PINs did not match. Try again" = "I PIN non corrispondono. Prova di nuovo";

// Help Titles
"iTunes Import/Export" = "iTunes Importa/Esporta";
"Dropbox Import/Export" = "Dropbox Importa/Esporta";
"Safari/Email Import" = "Safari/Email Importa";
"Create New Database" = "Crea un Nuovo Database";
"Key Files" = "Key Files";

// Password Generator
"Generator" = "Generatore";
"Length" = "Lunghezza";
"Character Sets" = "Set dei caratteri";
"Upper Case" = "Maiuscolo";
"Lower Case" = "Minuscolo";
"Upper" = "Maggiore";
"Lower" = "Minore";
"Digits" = "Numeri";
"Minus" = "Meno";
"Underline" = "Sottolineato";
"Space" = "Spazio";
"Special" = "Speciale";
"Brackets" = "Parentesi";
"None Selected" = "Nessuno selezionato";